[
  {
    "_id": "A101",
    "title": "Propulsion Assignment",
    "course": "RS101",
    "description": "Analyze and design a propulsion system for a spacecraft. This includes thrust calculation, fuel efficiency, and nozzle design."
  },
  {
    "_id": "A102",
    "title": "Combustion Analysis",
    "course": "RS101",
    "description": "Perform detailed combustion analysis for rocket fuels, focusing on chemical reactions, energy release, and exhaust products."
  },
  {
    "_id": "A103",
    "title": "Nozzle Design Project",
    "course": "RS101",
    "description": "Design an optimal nozzle for a rocket engine. The assignment includes computational fluid dynamics (CFD) analysis of nozzle shapes."
  },
  {
    "_id": "A201",
    "title": "Aerodynamics Quiz",
    "course": "RS102",
    "description": "A quiz covering fundamental principles of aerodynamics, including airfoil theory, lift and drag forces, and flow behavior."
  },
  {
    "_id": "A202",
    "title": "Flow Analysis",
    "course": "RS102",
    "description": "Conduct a comprehensive analysis of airflow around different geometries using both theoretical and simulation techniques."
  },
  {
    "_id": "A203",
    "title": "Heating Analysis",
    "course": "RS102",
    "description": "Investigate heat transfer mechanisms in aerospace structures under various conditions, including convection, conduction, and radiation."
  },
  {
    "_id": "A301",
    "title": "Structural Design Task",
    "course": "RS103",
    "description": "Design and analyze the structural components of a satellite. Focus on weight optimization and load-bearing capabilities."
  },
  {
    "_id": "A302",
    "title": "Orbital Calculations",
    "course": "RS103",
    "description": "Calculate satellite orbits using Kepler's laws. This includes determining orbital elements and plotting orbital paths."
  },
  {
    "_id": "A303",
    "title": "Systems Engineering Exam",
    "course": "RS103",
    "description": "An exam focused on systems engineering concepts, including requirements analysis, systems integration, and project lifecycle management."
  }
]
